; domain
(define (domain blocksword)
(:predicates
(sin_nada_encima ?x)
(encima_mesa ?x)
(brazo_libre)
(sujeto ?x)
(encima_bloque ?x ?y)
)
(:action coger
:parameters (?ob)
:precondition (and (sin_nada_encima ?ob)(encima_mesa ?ob)(brazo_libre))
:effect (and (sujeto ?ob) (not (sin_nada_encima ?ob)) (not (encima_mesa ?ob))(not
(brazo_libre)))
)
(:action soltar
:parameters (?ob)
:precondition (and (sujeto ?ob))
:effect (and (sin_nada_encima ?ob) (brazo_libre) (encima_mesa ?ob) (not (sujeto ?ob)))
)
(:action apilar
:parameters (?ob ?underob)
:precondition (and (sin_nada_encima ?underob)(sujeto ?ob))
:effect (and (sin_nada_encima ?ob) (brazo_libre) (encima_bloque ?ob ?underob) (not (sujeto
?ob))(not (sin_nada_encima ?underob)))
)
(:action desapilar
:parameters (?ob ?underob)
:precondition (and (encima_bloque ?ob ?underob) (sin_nada_encima ?ob) (brazo_libre))
:effect (and (sujeto ?ob) (sin_nada_encima ?underob) (not (encima_bloque ?ob ?underob)) (not
(sin_nada_encima ?ob)) (not (brazo_libre))))
)

; problem
(define (problem p01)
(:domain blocksword)
(:objects a b c d e)
(:init (encima_mesa a) (encima_mesa b) (encima_bloque c a) (encima_mesa e)
(sin_nada_encima b) (sin_nada_encima c) (sin_nada_encima e) (sujeto d))
(:goal (and (encima_bloque a b) (encima_bloque b c) (sin_nada_encima a) (encima_mesa c)))
)

; plan
1. (soltar d)
   deleted: (sujeto d)
   added: (sin_nada_encima d) (brazo_libre) (encima_mesa d)
   goals met: 0 of 4
2. (desapilar c a)
   deleted: (encima_bloque c a) (sin_nada_encima c) (brazo_libre)
   added: (sujeto c) (sin_nada_encima a)
   goals met: 1 of 4
3. (soltar c)
   deleted: (sujeto c)
   added: (sin_nada_encima c) (brazo_libre) (encima_mesa c)
   goals met: 2 of 4
4. (coger b)
   deleted: (sin_nada_encima b) (encima_mesa b) (brazo_libre)
   added: (sujeto b)
   goals met: 2 of 4
5. (apilar b c)
   deleted: (sujeto b) (sin_nada_encima c)
   added: (sin_nada_encima b) (brazo_libre) (encima_bloque b c)
   goals met: 3 of 4
6. (coger a)
   deleted: (sin_nada_encima a) (encima_mesa a) (brazo_libre)
   added: (sujeto a)
   goals met: 2 of 4
7. (apilar a b)
   deleted: (sujeto a) (sin_nada_encima b)
   added: (sin_nada_encima a) (brazo_libre) (encima_bloque a b)
   goals met: 4 of 4
